[
  {
    "id": 1,
    "userId": "prof_001",
    "noteTitle": "Πρώτη Συνάντηση με Φοιτητή",
    "noteContent": "Η πρώτη συνάντηση με τον φοιτητή ήταν πολύ παραγωγική. Συζητήσαμε τους στόχους της διπλωματικής εργασίας και καθορίσαμε το χρονοδιάγραμμα. Ο φοιτητής φαίνεται πολύ ενθουσιασμένος και έχει καλή κατανόηση του θέματος.",
    "dateCreated": "2025-01-15",
    "topicId": 2
  },
  {
    "id": 2,
    "userId": "prof_001",
    "noteTitle": "Πρόοδος Βιβλιογραφικής Ανασκόπησης",
    "noteContent": "Ο φοιτητής έχει προχωρήσει σημαντικά στη βιβλιογραφική ανασκόπηση. Έχει βρει πάνω από 15 σχετικές δημοσιεύσεις και έχει αρχίσει την ανάλυσή τους. Προτείνω να επικεντρωθεί στις πιο πρόσφατες μελέτες.",
    "dateCreated": "2025-01-22",
    "topicId": 2
  },
  {
    "id": 3,
    "userId": "prof_002",
    "noteTitle": "Καθορισμός Μεθοδολογίας",
    "noteContent": "Συζητήσαμε τη μεθοδολογία που θα ακολουθηθεί για την έρευνα. Αποφασίσαμε να χρησιμοποιήσουμε ποσοτικές μεθόδους ανάλυσης και να συλλέξουμε δεδομένα από τουλάχιστον 200 συμμετέχοντες.",
    "dateCreated": "2025-01-18",
    "topicId": 2
  },
  {
    "id": 4,
    "userId": "prof_001",
    "noteTitle": "Πρόβλημα με την Υλοποίηση",
    "noteContent": "Ο φοιτητής αντιμετωπίζει δυσκολίες με την υλοποίηση του αλγορίθμου. Χρειάζεται επιπλέον καθοδήγηση στον προγραμματισμό Python. Προγραμματίστηκε επιπλέον συνάντηση για την επόμενη εβδομάδα.",
    "dateCreated": "2025-02-01",
    "topicId": 1
  },
  {
    "id": 5,
    "userId": "prof_003",
    "noteTitle": "Εξαιρετική Πρόοδος",
    "noteContent": "Ο φοιτητής έχει κάνει εξαιρετική δουλειά τον τελευταίο μήνα. Τα αποτελέσματα των πειραμάτων είναι πολύ ενθαρρυντικά και δείχνουν σαφή βελτίωση σε σχέση με τις υπάρχουσες μεθόδους.",
    "dateCreated": "2025-02-05",
    "topicId": 3
  },
  {
    "id": 6,
    "userId": "prof_002",
    "noteTitle": "Συλλογή Δεδομένων",
    "noteContent": "Η φάση συλλογής δεδομένων προχωρά καλά. Έχουν συλλεχθεί δεδομένα από 150 συμμετέχοντες. Χρειάζονται άλλα 50 για να έχουμε στατιστικά σημαντικά αποτελέσματα.",
    "dateCreated": "2025-02-10",
    "topicId": 2
  },
  {
    "id": 7,
    "userId": "prof_004",
    "noteTitle": "Αρχική Αξιολόγηση",
    "noteContent": "Η πρώτη εντύπωση από τον φοιτητή είναι πολύ θετική. Έχει καλή θεωρητική κατάρτιση και φαίνεται να κατανοεί το θέμα σε βάθος. Αναμένω πολύ καλά αποτελέσματα.",
    "dateCreated": "2025-01-20",
    "topicId": 4
  },
  {
    "id": 8,
    "userId": "prof_003",
    "noteTitle": "Αναθεώρηση Κεφαλαίου",
    "noteContent": "Το πρώτο κεφάλαιο χρειάζεται σημαντική αναθεώρηση. Η δομή είναι καλή αλλά χρειάζεται περισσότερη ανάλυση και σύνδεση με τη βιβλιογραφία. Ο φοιτητής θα το επαναυποβάλει σε δύο εβδομάδες.",
    "dateCreated": "2025-02-15",
    "topicId": 3
  },
  {
    "id": 9,
    "userId": "prof_001",
    "noteTitle": "Επιτυχής Παρουσίαση",
    "noteContent": "Η ενδιάμεση παρουσίαση ήταν πολύ επιτυχής. Ο φοιτητής παρουσίασε με σαφήνεια τα αποτελέσματά του και απάντησε ικανοποιητικά σε όλες τις ερωτήσεις. Είμαι πολύ ικανοποιημένος με την πρόοδό του.",
    "dateCreated": "2025-03-01",
    "topicId": 1
  },
  {
    "id": 10,
    "userId": "prof_005",
    "noteTitle": "Προβλήματα με την Τεκμηρίωση",
    "noteContent": "Ο φοιτητής δεν έχει τηρήσει τις οδηγίες για την τεκμηρίωση του κώδικα. Χρειάζεται να βελτιώσει σημαντικά αυτό το κομμάτι πριν προχωρήσουμε στην επόμενη φάση.",
    "dateCreated": "2025-02-18",
    "topicId": 5
  },
  {
    "id": 11,
    "userId": "prof_004",
    "noteTitle": "Ολοκλήρωση Πειραμάτων",
    "noteContent": "Όλα τα πειράματα έχουν ολοκληρωθεί επιτυχώς. Τα αποτελέσματα είναι εντυπωσιακά και ξεπερνούν τις αρχικές προσδοκίες. Ο φοιτητής μπορεί να προχωρήσει στη σύνταξη του τελικού κεφαλαίου.",
    "dateCreated": "2025-03-10",
    "topicId": 4
  },
  {
    "id": 12,
    "userId": "prof_002",
    "noteTitle": "Στατιστική Ανάλυση",
    "noteContent": "Η στατιστική ανάλυση των δεδομένων έχει ολοκληρωθεί. Τα αποτελέσματα είναι στατιστικά σημαντικά και επιβεβαιώνουν τις αρχικές υποθέσεις της έρευνας.",
    "dateCreated": "2025-03-05",
    "topicId": 2
  },
  {
    "id": 13,
    "userId": "prof_006",
    "noteTitle": "Πρώτη Συνάντηση",
    "noteContent": "Γνώρισα τον φοιτητή για πρώτη φορά σήμερα. Φαίνεται πολύ προετοιμασμένος και έχει ήδη μια καλή ιδέα για το πώς θέλει να προσεγγίσει το θέμα. Πολύ θετική πρώτη εντύπωση.",
    "dateCreated": "2025-01-25",
    "topicId": 6
  },
  {
    "id": 14,
    "userId": "prof_005",
    "noteTitle": "Βελτίωση Κώδικα",
    "noteContent": "Ο φοιτητής έχει βελτιώσει σημαντικά την ποιότητα του κώδικα μετά τις παρατηρήσεις μου. Η τεκμηρίωση είναι πλέον σε καλό επίπεδο και ο κώδικας είναι πιο καθαρός.",
    "dateCreated": "2025-03-01",
    "topicId": 5
  },
  {
    "id": 15,
    "userId": "prof_003",
    "noteTitle": "Προετοιμασία για Παρουσίαση",
    "noteContent": "Ο φοιτητής προετοιμάζεται για την τελική παρουσίαση. Έχουμε επαναλάβει πολλές φορές και είμαι σίγουρος ότι θα τα πάει πολύ καλά. Έχει καταφέρει να συνθέσει εξαιρετικά τα αποτελέσματά του.",
    "dateCreated": "2025-04-15",
    "topicId": 3
  },
  {
    "id": 16,
    "userId": "prof_006",
    "noteTitle": "Ενδιάμεση Αξιολόγηση",
    "noteContent": "Στη μέση της διαδικασίας, η πρόοδος είναι ικανοποιητική. Ο φοιτητής δείχνει συνέπεια και αφοσίωση στην εργασία του. Χρειάζεται λίγη περισσότερη εμβάθυνση στη θεωρία.",
    "dateCreated": "2025-02-28",
    "topicId": 6
  },
  {
    "id": 17,
    "userId": "prof_004",
    "noteTitle": "Τελική Αναθεώρηση",
    "noteContent": "Η τελική αναθεώρηση της διπλωματικής εργασίας έχει ολοκληρωθεί. Όλες οι παρατηρήσεις έχουν ληφθεί υπόψη και το έργο είναι έτοιμο για υποβολή. Συγχαρητήρια στον φοιτητή!",
    "dateCreated": "2025-04-20",
    "topicId": 4
  },
  {
    "id": 18,
    "userId": "prof_007",
    "noteTitle": "Αρχή Συνεργασίας",
    "noteContent": "Σήμερα ξεκινήσαμε την επίσημη συνεργασία. Ο φοιτητής έχει ένα φιλόδοξο πλάνο και καλές ιδέες. Θα χρειαστεί καθοδήγηση στην υλοποίηση αλλά έχω εμπιστοσύνη στις δυνατότητές του.",
    "dateCreated": "2025-01-30",
    "topicId": 7
  },
  {
    "id": 19,
    "userId": "prof_005",
    "noteTitle": "Επιτυχής Ολοκλήρωση",
    "noteContent": "Η διπλωματική εργασία έχει ολοκληρωθεί επιτυχώς. Ο φοιτητής κατάφερε να ξεπεράσει όλες τις δυσκολίες και να παραδώσει ένα εξαιρετικό έργο. Αξίζει συγχαρητήρια για την επιμονή του.",
    "dateCreated": "2025-04-25",
    "topicId": 5
  },
  {
    "id": 20,
    "userId": "prof_007",
    "noteTitle": "Πρόοδος Υλοποίησης",
    "noteContent": "Η υλοποίηση προχωρά σταθερά. Ο φοιτητής έχει ολοκληρώσει το 60% της εφαρμογής και τα αποτελέσματα είναι πολύ ενθαρρυντικά. Αναμένω να ολοκληρωθεί εντός του επόμενου μήνα.",
    "dateCreated": "2025-03-15",
    "topicId": 7
  }
]
